/**
 * Copyright (C), 2015-2018, XXX有限公司
 * FileName: Main
 * Author:   yuxing1994
 * Date:     2018/9/1 20:30
 * Description:
 * History:
 * <author>          <time>          <version>          <desc>
 * 作者姓名           修改时间           版本号              描述
 */

/**
 * 单一职责原则： 一个类只负责一项职责（高内聚）
 * 里氏替换原则：引用父类的地方也可以引用子类（继承中尽量不重写重载父类的方法，增加新的属性和方法）
 * 依赖倒置原则：高层模块不应该依赖低层模块，二者都应该依赖其抽象；抽象不应该依赖细节；细节应该依赖抽象，核心思想是面向接口编程
 * 接口隔离原则：建立单一接口，不要建立庞大臃肿的接口，尽量细化接口，接口中的方法尽量少。也就是说，我们要为各个类建立专用的接口，而不要试图去建立一个很庞大的接口供所有依赖它的类去调用
 * 最少知道原则：一个对象应该对其他对象保持最少的了解(低耦合)
 *
 * 开闭原则： 扩展开放、修改关闭
 */

public class Main {

    public static void main(String args[]) {

    }
}

